src/test/resources/jmeter/testJMeterBZ.yaml
provisioning: cloud

modules:
  jmeter:
    version: 3.3
  console:
    disable: true
  cloud:
    token: ${BZ_TOKEN}

execution:
- concurrency: 1
  scenario: test
  hold-for: 10s
  files:
  - lib

scenarios:
  test:
    script: RTESampler.jmx
    
reporting:
- module: passfail
  criteria:
  - failures>0%