src/test/resources/jmeter/testJMeterBZ.yaml
provisioning: cloud

modules:
  jmeter:
    version: "4.0"
    properties:
      log_level: DEBUG
      user.classpath: lib
  console:
    disable: true
  cloud:
    token: ${BZ_TOKEN}

execution:
- concurrency: 1
  scenario:
    script: RTESampler3270.jmx
  iterations : 3
  files:
  - lib
  - tn3270
- concurrency: 1
  scenario:
    script: RTESampler5250.jmx
  iterations: 3
  files:
  - lib
  - tn5250

reporting:
- module: passfail
  criteria:
  - failures>0%